# Seaborn Heatmap
-  https://seaborn.pydata.org/generated/seaborn.heatmap.html

In [2]:
#libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from pydataset import data

In [9]:
# data
mtcars = data('mtcars')
iris = data('iris')
glue = sns.load_dataset('glue')
penguins = sns.load_dataset("penguins")

In [5]:
mtcars.head(2)

                mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4      21.0    6  160.0  110   3.9  2.620  16.46   0   1     4     4
Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.875  17.02   0   1     4     4

In [7]:
iris.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa

In [8]:
glue.head(2)

   Model  Year      Encoder  Task  Score
0  ERNIE  2019  Transformer  CoLA   75.5
1     T5  2019  Transformer  CoLA   71.6

In [10]:
penguins.head(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female